In [1]:
import numpy as np 
import pandas as pd

**Creating a DataFrame**

In [44]:
# create dataframe using dictonary
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df1=pd.DataFrame(data)
df1

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [55]:
# create dataframe using list
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2=pd.DataFrame(data_list)
df2
col=["Name","Age","City","Salary"]
df2=pd.DataFrame(data_list,columns=col)
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

**Selection and Indexing of Columns**

In [56]:
#single column without column name
df2['Age']

0    28
1    34
2    29
3    42
Name: Age, dtype: int64

In [57]:
#single column with column name
df2[['Name']]

    Name
0   John
1   Anna
2  Peter
3  Linda

In [58]:
#multiple column 
df2[['Age','Name']]

   Age   Name
0   28   John
1   34   Anna
2   29  Peter
3   42  Linda

In [59]:
#single row value
df2.iloc[0]

Name          John
Age             28
City      New York
Salary       65000
Name: 0, dtype: object

In [60]:
#multigle row value
df2.iloc[[0,1]]

   Name  Age      City  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

**Creating a new column**

In [61]:
df2['Occupation']=['Doctor','Eng','Teacher','Farmer']
df2

    Name  Age      City  Salary Occupation
0   John   28  New York   65000     Doctor
1   Anna   34     Paris   70000        Eng
2  Peter   29    Berlin   62000    Teacher
3  Linda   42    London   85000     Farmer

**Drop**

In [62]:
df2.drop('Occupation',axis = 1,inplace=True)
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [63]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [65]:
#drop multiple column 
df2.drop(['Name','Age'],axis=1)

       City  Salary
0  New York   65000
1     Paris   70000
2    Berlin   62000
3    London   85000

**Selecting Subsets of Rows and Columns**

In [66]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [69]:
df2.loc[[0,1]][['City','Salary']]

       City  Salary
0  New York   65000
1     Paris   70000

**Conditional Selection**

In [70]:
#i only want to see people whose age is more than 30
df2[df2['Age']>30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [72]:
#i only want to see people whose age is more than 30 and their city must be paris
df2[(df2['Age']>30)&(df2['City']=='Paris')]

   Name  Age   City  Salary
1  Anna   34  Paris   70000